app/controllers/activities_controller.rb

SELECT * FROM "questions" WHERE ("questions"."question_type" = 1) ORDER BY id
---
  def index
    @questions = Question.find(:all, :order => :id, :conditions => { :question_type => 1 } )

SELECT * FROM "activities" WHERE ("activities"."id" = 1 AND ("activities".response_id = 1))
---
  def show
    @activity = @response.activities.find(params[:id])

SELECT * FROM "questions" WHERE ("questions"."question_type" = 1) ORDER BY id
---
  def new
    @questions = Question.find(:all, :order => :id, :conditions => { :question_type => 1 } )

SELECT * FROM "questions" WHERE ("questions"."question_type" = 1) ORDER BY id
SELECT * FROM "activities" WHERE ("activities"."id" = 1 AND ("activities".response_id = 1))
---
  def edit
    @questions = Question.find(:all, :order => :id, :conditions => { :question_type => 1 } )
    @activity = @response.activities.find(params[:id])

SELECT * FROM "questions" WHERE ("questions"."question_type" = 1)
SELECT * FROM "questions"
INSERT INTO "activities" ("question_id", "created_at", "comments", "published", "evidence", "updated_at", "system", "response_id", "entry_date") VALUES(1, '2011-02-22 17:37:19', 'I think it''s awesome', 1, 'Here''s the website:', '2011-02-22 17:37:19', 'Aries', 1, '2011-02-22')
---
  def create
	# do this for each question
	@questions = Question.find(:all, :conditions => { :question_type => 1 } )
		@questions.each do |question|


		    @activity_params = params["#{question.id}"]
		    @activity_params[:entry_date] = Date.today
		    @activity = @response.activities.build(@activity_params)

		    # was @activity = Activity.new(params[:activity])


		      if @activity.save

SELECT * FROM "activities" WHERE ("activities"."id" = 1 AND ("activities".response_id = 1))
UPDATE "activities" SET "updated_at" = '2011-03-15 19:02:00', "evidence" = 'Here''s the website: http://www.usaid.gov' WHERE "id" = 1
---
  def update
    @activity = @response.activities.find(params[:id])
    # was @activity = Activity.find(params[:id])

    respond_to do |format|
      if @activity.update_attributes(params[:activity])

SELECT * FROM "activities" WHERE ("activities"."id" = 5 AND ("activities".response_id = 1))
DELETE FROM "activities" WHERE "id" = 48
---
  def destroy
    @activity = @response.activities.find(params[:id])
    # was @activity = Activity.find(params[:id])
    @activity.destroy