app/controllers/data_organisations_controller.rb

SELECT * FROM "questions" WHERE ("questions"."question_type" = 3) ORDER BY id
---
  def index

  @questions = Question.find(:all, :order => :id, :conditions => { :question_type => 3 } )

SELECT * FROM "questions" WHERE ("questions"."question_type" = 3) ORDER BY id
---
  def new
    @questions = Question.find(:all, :order => :id, :conditions => { :question_type => 3 } )

SELECT * FROM "questions" WHERE ("questions"."question_type" = 3)
INSERT INTO "data_organisations" ("question_id", "created_at", "comments", "published", "evidence", "updated_at", "response_id", "entry_date") VALUES(7, '2011-03-19 19:39:10', '', 1, '', '2011-03-19 19:39:10', 17, '2011-03-19')
---
  def create
    # do this for each question
	@questions = Question.find(:all, :conditions => { :question_type => 3 } )
		@questions.each do |question|


	    @data_organisation_params = params["#{question.id}"]
	    @data_organisation_params[:entry_date] = Date.today
	    @data_organisation = @response.data_organisations.build(@data_organisation_params)

		    #@data_organisation = @response.data_organisations.build(params["#{question.id}"])
		    # @data_organisation = DataOrganisation.new(params[:data_organisation])

		      if @data_organisation.save