app/controllers/data_countries_controller.rb

  def index
    @questions = Question.find(:all, :order => :id, :conditions => { :question_type => 2 } )
---
SELECT * FROM "questions" WHERE ("questions"."question_type" = 2) ORDER BY id

  def new
    @questions = Question.find(:all, :order => :id, :conditions => { :question_type => 2 } )
---
SELECT * FROM "questions" WHERE ("questions"."question_type" = 1) ORDER BY id

  def create
	# do this for each question
	@questions = Question.find(:all, :conditions => { :question_type => 2 } )
	@questions.each do |question|
	    @data_country_params = params["#{question.id}"]
	    @data_country_params[:entry_date] = Date.today
	    @data_country = @response.data_countries.build(@data_country_params)

	      if @data_country.save
---
SELECT * FROM "questions" WHERE ("questions"."question_type" = 2)
INSERT INTO "data_countries" ("question_id", "created_at", "comments", "published", "evidence", "updated_at", "system", "response_id", "entry_date") VALUES(11, '2011-03-19 19:32:17', '', 1, '', '2011-03-19 19:32:17', '', 18, '2011-03-19')