app/controllers/data_organisations_controller.rb

SELECT * FROM "data_organisations" WHERE ("data_organisations".response_id = 6)
---
  def index
    @data_organisations = DataOrganisation.all