app/controllers/donors_controller.rb

  def index
    @donors = Donor.all
---
SELECT * FROM "donors"

  def show
    @donor = Donor.find(params[:id])
---
SELECT * FROM "donors" WHERE ("donors"."id" = 1)

  def edit
    @donor = Donor.find(params[:id])
---
SELECT * FROM "donors" WHERE ("donors"."id" = 1)

  def create
    @donor = Donor.new(params[:donor])

    respond_to do |format|
      if @donor.save
---
INSERT INTO "donors" ("name", "created_at", "updated_at", "country_id", "description") VALUES('USAID', '2011-03-15 18:58:46', '2011-03-15 18:58:46', 1, '')