app/controllers/questions_controller.rb

SELECT * FROM "questions" WHERE ("questions"."id" = 1)
---
  def show
    @question = Question.find(params[:id])

SELECT * FROM "questions" WHERE ("questions"."id" = 1)
---
  def edit
    @question = Question.find(params[:id])

INSERT INTO "questions" ("question_long", "example", "question_type", "created_at", "updated_at", "question_short", "description") VALUES('Does this donor publish which organisation funds the activity?', '', 1, '2011-02-21 23:43:34', '2011-02-21 23:43:34', 'Funder', '')
---
  def create
    @question = Question.new(params[:question])

    respond_to do |format|
      if @question.save

SELECT * FROM "questions" WHERE ("questions"."id" = 1)
UPDATE "questions" SET "updated_at" = '2011-03-16 10:08:59', "example" = 'UK Department for International Development' WHERE "id" = 1
---
  def update
    @question = Question.find(params[:id])

    respond_to do |format|
      if @question.update_attributes(params[:question])