app/controllers/responses_controller.rb

  def index

    @responses = Response.all
    @responses_user = Response.find(:all, :conditions => { :user_id => current_user.id } )

    @responses_donors = Response.find(:all, :group=>"donor_id")
---
SELECT * FROM "responses" GROUP BY donor_id
SELECT * FROM "responses" WHERE ("responses"."user_id" = 1)
SELECT * FROM "responses" WHERE ("responses"."donor_id" = 1) GROUP BY recipient_id

  def show
    @response = Response.find(params[:id])
---
SELECT * FROM "responses" WHERE ("responses"."id" = 1)

  def edit
    @response = Response.find(params[:id])
---
SELECT * FROM "responses" WHERE ("responses"."id" = 1)

  def create
    @response = Response.new(params[:response])

    respond_to do |format|
      if @response.save
---
INSERT INTO "responses" ("donor_id", "created_at", "response_type", "updated_at", "recipient_id", "user_id", "description", "entry_date", "status") VALUES(1, '2011-02-21 23:37:27', 1, '2011-02-21 23:37:27', 1, 1, 'Just some text', '2011-02-21', 1)

  def update
    @response = Response.find(params[:id])
---
SELECT * FROM "responses" WHERE ("responses"."id" = 1)

  def destroy
    @response = Response.find(params[:id])
    @response.destroy
---
SELECT * FROM "responses" WHERE ("responses"."id" = 16)
DELETE FROM "responses" WHERE "id" = 16