app/controllers/users_controller.rb

  def create
    @user_params = params[:user]
    # if the user is not logged in, then restrict roles
	if current_user
		if current_user.role != '1'
	    	  @user_params[:role] = '2'
		end
	end
    @user = User.new(@user_params)
    if @user.save
---
INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "role", "country_id", "failed_login_count", "current_login_ip", "organisation_name", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "email") VALUES('U6NzSwTPRjidLrsbJiV', '2011-03-17 18:38:24', '2011-03-17 18:38:24', 'c91abe61c3282833d9892a70b0f05c634571a15f22cbb131921abd49274dad80799eabf9dd5edf3efb304ca1bfe2937e3ff9c94d067490b17fbea047dad1dc25', 'zZbatGwfm7IV7LNWaT9', '2011-03-17 18:38:24', '2', 1, 0, '127.0.0.1', '1', 'tHuwV5Aoe39AbfbqZhD', '2011-03-17 18:38:24', '86032c418c7f0c22be36d9180ffa4de5ab74ee4bdf7cf6eb67917eb0a2907c05d4f1e7c44af23e01ed1b596129556430eebb1e91b66a3b18dd78c1cb57b12340', 1, NULL, 'fred', NULL, 'fred@fred.fred')

  def show
	# admin can change all users
	if current_user.role == '1'
	  @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1

  def edit
	# admin can change all users
	if current_user.role == '1'
	  @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1

  def update
	# admin can change all users
	if current_user.role == '1'
	  @user = User.find(params[:id])
	else
	# other users can only change themselves
	  @user = @current_user
	end
    if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
UPDATE "users" SET "updated_at" = '2011-03-17 13:09:03', "role" = '1', "perishable_token" = 'YVMtg5GlboUkqAbbh768', "organisation_name" = 'Publish What You Fund' WHERE "id" = 1